MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32F103KBU/mcu.h
/*******************  Bit definition for SETUP2 register  *******************/
#define  SETUP2                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP3 register  *******************/
#define  SETUP3                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP4 register  *******************/
#define  SETUP4                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP5 register  *******************/
#define  SETUP5                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP6 register  *******************/
#define  SETUP6                             ((uint16_t)0x00FF)

/*******************  Bit definition for SETUP7 register  *******************/
#define  SETUP7                             ((uint16_t)0x00FF)

/*******************  Bit definition for PACKET_SIZE1 register  *******************/
#define  PACKET_SIZE1                        ((uint16_t)0x00FF)

/*******************  Bit definition for PACKET_SIZE2 register  *******************/
#define  PACKET_SIZE2                        ((uint16_t)0x00FF)

/*******************  Bit definition for EP0_AVIL register  *******************/
#define  EP0_AVIL_EPXAVIL                   ((uint16_t)0x00FF)

/*******************  Bit definition for EP1_AVIL register  *******************/
#define  EP1_AVIL_EPXAVIL                   ((uint16_t)0x00FF)

/*******************  Bit definition for EP2_AVIL register  *******************/
#define  EP2_AVIL_EPXAVIL                   ((uint16_t)0x00FF)

/*******************  Bit definition for EP3_AVIL register  *******************/
#define  EP3_AVIL_EPXAVIL                   ((uint16_t)0x00FF)

/*******************  Bit definition for EP4_AVIL register  *******************/
#define  EP4_AVIL_EPXAVIL                   ((uint16_t)0x00FF)

/*******************  Bit definition for EP0_CTRL register  *******************/
#define  EP0_CTRL_TRANEN                    ((uint16_t)0x0080)

#define  EP0_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP0_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP0_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP0_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP0_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP0_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP0_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP0_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP1_CTRL register  *******************/
#define  EP1_CTRL_TRANEN                    ((uint16_t)0x0080)

#define  EP1_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP1_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP1_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP1_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP1_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP1_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP1_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP1_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP2_CTRL register  *******************/
#define  EP2_CTRL_TRANEN                    ((uint16_t)0x0080)

#define  EP2_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP2_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP2_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP2_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP2_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP2_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP2_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP2_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP3_CTRL register  *******************/
#define  EP3_CTRL_TRANEN                    ((uint16_t)0x0080)

#define  EP3_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP3_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP3_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP3_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP3_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP3_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP3_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP3_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP4_CTRL register  *******************/
#define  EP4_CTRL_TRANEN                    ((uint16_t)0x0080)

#define  EP4_CTRL_TRANCOUNT                 ((uint16_t)0x007F)
#define  EP4_CTRL_TRANCOUNT_0               ((uint16_t)0x0001)
#define  EP4_CTRL_TRANCOUNT_1               ((uint16_t)0x0002)
#define  EP4_CTRL_TRANCOUNT_2               ((uint16_t)0x0004)
#define  EP4_CTRL_TRANCOUNT_3               ((uint16_t)0x0008)
#define  EP4_CTRL_TRANCOUNT_4               ((uint16_t)0x0010)
#define  EP4_CTRL_TRANCOUNT_5               ((uint16_t)0x0020)
#define  EP4_CTRL_TRANCOUNT_6               ((uint16_t)0x0040)

/*******************  Bit definition for EP_DMA register  *******************/
#define  EP_DMA_DMA1EN                      ((uint16_t)0x0001)
#define  EP_DMA_DMA2EN                      ((uint16_t)0x0002)

/*******************  Bit definition for EP_HALT register  *******************/
#define  EP_HALT_HALT0                      ((uint16_t)0x0001)
#define  EP_HALT_HALT1                      ((uint16_t)0x0002)
#define  EP_HALT_HALT2                      ((uint16_t)0x0004)
#define  EP_HALT_HALT3                      ((uint16_t)0x0008)
#define  EP_HALT_HALT4                      ((uint16_t)0x0010)

/*******************  Bit definition for USB_POWER register  *******************/
#define  USB_POWER_SUSPEN                   ((uint16_t)0x0001)
#define  USB_POWER_SUSP                     ((uint16_t)0x0002)
#define  USB_POWER_WKUP                     ((uint16_t)0x0008)


/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for SPI_TXREG register  ********************/
#define  SPI_TXREG_TXREG                     ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for SPI_RXREG register  ********************/
#define  SPI_RXREG_RXREG                     ((uint32_t)0xFFFFFFFF)

